In [3]:
#missing data

import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [10]:
#if only want to look at column
#Axis (0,1)
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [11]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
#fill in missing values
df.fillna(value='Missing')

         A        B  C
0        1        5  1
1        2  Missing  2
2  Missing  Missing  3

In [13]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [14]:
#groupby

data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'PERSON':['SAM','CHARLIE','AMY','VANESSA','CARL','TINA'],'SALES':[12,13,14,15,16,17]}

In [15]:
df=pd.DataFrame(data)

In [16]:
df

  Company   PERSON  SALES
0    GOOG      SAM     12
1    GOOG  CHARLIE     13
2    MSFT      AMY     14
3    MSFT  VANESSA     15
4      FB     CARL     16
5      FB     TINA     17

In [18]:
#pd.groupby()
by_company=df.groupby('Company')

In [19]:
by_company

In [20]:
by_company.mean()

         SALES
Company
FB        16.5
GOOG      12.5
MSFT      14.5

In [22]:
df.groupby('Company').mean()

         SALES
Company
FB        16.5
GOOG      12.5
MSFT      14.5

In [23]:
df.groupby('Company').count()

         PERSON  SALES
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [33]:
by_company.describe()

        SALES
        count  mean       std   min    25%   50%    75%   max
Company
FB        2.0  16.5  0.707107  16.0  16.25  16.5  16.75  17.0
GOOG      2.0  12.5  0.707107  12.0  12.25  12.5  12.75  13.0
MSFT      2.0  14.5  0.707107  14.0  14.25  14.5  14.75  15.0

In [32]:
by_company.describe().transpose()['GOOG']

SALES  count     2.000000
       mean     12.500000
       std       0.707107
       min      12.000000
       25%      12.250000
       50%      12.500000
       75%      12.750000
       max      13.000000
Name: GOOG, dtype: float64

In [26]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [27]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [28]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [35]:
#concatenation, like rbind and cbind
#pd.concat()

pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [39]:
#merging
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [41]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [42]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [44]:
#left - 'left'
#right - 'right'
#inner - 'inner'
#outer - 'outer'
#(think of the venn diagram for which information is joined by a commonality and those with missing info)

pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [79]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [80]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [81]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [82]:
# Using two keys
pd.merge(left, right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [84]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])
#can index by left or right = using left_index=true, but would have the redo the keys?
#probably easier to just join

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [71]:
left2 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [72]:
left2

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [73]:
right2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [76]:
left2.join(right2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [77]:
right2.join(left2)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [85]:
#pandas operations

df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [86]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [87]:
df.head

<bound method NDFrame.head of    col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz>

In [88]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [89]:
df.tail(2)

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [90]:
#unique values, use unique()

df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [91]:
#number of unique values

df['col2'].nunique()

3

In [92]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [93]:
#permanently delete something from column
del df['col1']

In [94]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [96]:
#will tell you the names of the columns are

df.columns

Index(['col2', 'col3'], dtype='object')

In [97]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [98]:
df.set_index('col2',inplace=True)

In [99]:
df.index

Int64Index([444, 555, 666, 444], dtype='int64', name='col2')

In [100]:
#sort values
#not permanent unless use inplace=True
df.sort_values(by='col3')

     col3
col2
444   abc
555   def
666   ghi
444   xyz

In [101]:
#to find missing values 
#df.isnull() --> is similar to is.na in R
df.isnull()

       col3
col2
444   False
555   False
666   False
444   False

In [102]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [103]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [104]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN